S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/sdk_defs.h
/**
 * \addtogroup BSP
 * \{
 * \addtogroup SYSTEM
 * \{
 * \addtogroup PLATFORM
 *
 * \brief Platform definitions
 *
 * \{
 */

/**
 ****************************************************************************************
 *
 * @file sdk_defs.h
 *
 * @brief Central include header file with platform definitions.
 *
 * Copyright (C) 2015-2018 Dialog Semiconductor.
 * This computer program includes Confidential, Proprietary Information
 * of Dialog Semiconductor. All Rights Reserved.
 *
 ****************************************************************************************
 */

#ifndef __SDK_DEFS_H__
#define __SDK_DEFS_H__

#include <stddef.h>

#ifdef __cplusplus
 extern "C" {
#endif

#ifdef __GNUC__
#  define GCC_VERSION (__GNUC__ * 10000 \
                               + __GNUC_MINOR__ * 100 \
                               + __GNUC_PATCHLEVEL__)
/* assert gcc version is at least 4.9.3 */
#  if GCC_VERSION < 40903
#    error "Please use gcc version 4.9.3 or newer!"
#  endif
#endif

#if (dg_configUSE_AUTO_CHIP_DETECTION == 1)

   /* use a register description that is generic enough for our needs */
#  include "DA14680AE.h"

#else

#if dg_configBLACK_ORCA_IC_REV == BLACK_ORCA_IC_REV_A
#  if dg_configBLACK_ORCA_IC_STEP == BLACK_ORCA_IC_STEP_E
#       include "DA14680AE.h"
#  else
#       error "Unknown chip stepping for revision A -- check the value of dg_configBLACK_ORCA_IC_STEP"
#  endif
#elif dg_configBLACK_ORCA_IC_REV == BLACK_ORCA_IC_REV_B
#  if dg_configBLACK_ORCA_IC_STEP == BLACK_ORCA_IC_STEP_B
#       include "DA14680BB.h"
#  else
#       error "Unknown chip stepping for revision B -- check the value of dg_configBLACK_ORCA_IC_STEP"
#  endif
#else
#  error "Unknown chip revision -- check the value of dg_configBLACK_ORCA_IC_REV"
#endif

#endif

#include "core_cm0.h"                               /* Cortex-M0 processor and core peripherals                              */
#include "system_DA14680.h"                         /* DA14680AA System                                                      */

/************************
 * Memory map
 ************************/

/**
 * \brief Remapped device base address.
 */
#define MEMORY_REMAPPED_BASE    0x00000000UL
#define MEMORY_REMAPPED_END     0x04000000UL

/**
 * \brief Remapped device memory size (64MiB).
 */
#define MEMORY_REMAPPED_SIZE    (MEMORY_REMAPPED_END - MEMORY_REMAPPED_BASE)

/**
 * \brief ROM base address.
 */
#define MEMORY_ROM_BASE         0x07F00000UL
#define MEMORY_ROM_END          0x07F40000UL

/**
 * \brief ROM memory size (256KiB).
 */
#define MEMORY_ROM_SIZE         (MEMORY_ROM_END - MEMORY_ROM_BASE)

/**
 * \brief OTP Controller base address.
 */
#define MEMORY_OTPC_BASE        0x07F40000UL
#define MEMORY_OTPC_END         0x07F80000UL

/**
 * \brief OTP memory base address.
 */
#define MEMORY_OTP_BASE         0x07F80000UL
#define MEMORY_OTP_END          0x07FC0000UL

/**
 * \brief OTP memory size (256KiB).
 */
#define MEMORY_OTP_SIZE         (MEMORY_OTP_END - MEMORY_OTP_BASE)

/**
 * \brief SYSTEM RAM base address.
 */
#define MEMORY_SYSRAM_BASE      0x07FC0000UL
#define MEMORY_SYSRAM_END       0x07FE0000UL

/**
 * \brief SYSTEM RAM size (128KiB).
 */
#define MEMORY_SYSRAM_SIZE      (MEMORY_SYSRAM_END - MEMORY_SYSRAM_BASE)

/**
 * \brief CACHE RAM base address.
 */
#define MEMORY_CACHERAM_BASE    0x07FE0000UL
#define MEMORY_CACHERAM_END     0x08000000UL

/**
 * \brief CACHE RAM size (128KiB).
 */
#define MEMORY_CACHERAM_SIZE    (MEMORY_CACHERAM_END - MEMORY_CACHERAM_BASE)

/**
 * \brief QSPI Flash base address.
 */
#define MEMORY_QSPIF_BASE       0x08000000UL
#define MEMORY_QSPIF_END        0x0BF00000UL

/**
 * \brief QSPI Flash memory size (63MiB).
 */
#define MEMORY_QSPIF_SIZE       (MEMORY_QSPIF_END - MEMORY_QSPIF_BASE)

/**
 * \brief QSPI Controller base address.
 */
#define MEMORY_QSPIC_BASE       0x0C000000UL
#define MEMORY_QSPIC_END        0x0C100000UL

/**
 * \brief ECC engine microcode base address.
 */
#define MEMORY_ECC_UCODE_BASE   0x40030000UL

/**
 * \brief TRNG FIFO address
 */
#define MEMORY_TRNG_FIFO        0x40040000UL

#define WITHIN_RANGE(_a, _s, _e)        (((uint32_t)(_a) >= (uint32_t)(_s)) && ((uint32_t)(_a) < (uint32_t)(_e)))

/**
 * \brief Address is in the remapped memory region
 */
#define IS_REMAPPED_ADDRESS(_a)         WITHIN_RANGE((_a), MEMORY_REMAPPED_BASE, MEMORY_REMAPPED_END)

/**
 * \brief Address is in the ROM region
 */
#define IS_ROM_ADDRESS(_a)              WITHIN_RANGE((_a), MEMORY_ROM_BASE, MEMORY_ROM_END)

/**
 * \brief Address is in the OTP memory region
 */
#define IS_OTP_ADDRESS(_a)              WITHIN_RANGE((_a), MEMORY_OTP_BASE, MEMORY_OTP_END)

/**
 * \brief Address is in the OTP Controller memory region
 */
#define IS_OTPC_ADDRESS(_a)             WITHIN_RANGE((_a), MEMORY_OTPC_BASE, MEMORY_OTPC_END)

/**
 * \brief Address is in the SYSTEM RAM region
 */
#define IS_SYSRAM_ADDRESS(_a)           WITHIN_RANGE((_a), MEMORY_SYSRAM_BASE, MEMORY_SYSRAM_END)

/**
 * \brief Address is in the CACHE RAM region
 */
#define IS_CACHERAM_ADDRESS(_a)         WITHIN_RANGE((_a), MEMORY_CACHERAM_BASE, MEMORY_CACHERAM_END)

/**
 * \brief Address is in the QSPI Flash memory region
 */
#define IS_QSPIF_ADDRESS(_a)            WITHIN_RANGE((_a), MEMORY_QSPIF_BASE, MEMORY_QSPIF_END)

/**
 * \brief Address is in the QSPI Controller memory region
 */
#define IS_QSPIC_ADDRESS(_a)            WITHIN_RANGE((_a), MEMORY_QSPIC_BASE, MEMORY_QSPIC_END)

#define _BLACK_ORCA_IC_VERSION(revision, stepping) \
        (((revision) << 8) | (stepping))

/**
 * \brief Convenience macro to create the full chip version from revision and stepping.
 *        It takes letters as arguments.
 */
#define BLACK_ORCA_IC_VERSION(revision, stepping) \
        _BLACK_ORCA_IC_VERSION(BLACK_ORCA_IC_REV_##revision, \
                        BLACK_ORCA_IC_STEP_##stepping)

/**
 * \brief The chip version that we compile for.
 */
#define BLACK_ORCA_TARGET_IC \
         _BLACK_ORCA_IC_VERSION(dg_configBLACK_ORCA_IC_REV, dg_configBLACK_ORCA_IC_STEP)


/**
 * \brief Zero-initialized data retained memory attribute
 */
#define __RETAINED              __attribute__((section("retention_mem_zi")))    // RetRAM0
#define __RETAINED_1            __attribute__((section("retention_mem_1_zi")))  // RetRAM1

/**
 * \brief Initialized data retained memory attribute
 */
#define __RETAINED_RW           __attribute__((section("retention_mem_init")))

/**
 * \brief Uninitialized data retained memory attribute
 */
#define __RETAINED_UNINIT       __attribute__((section("retention_mem_uninit")))

 /**
  * \brief Constant data retained memory attribute
  */
 #define __RETAINED_CONST_INIT  __attribute__((section("retention_mem_const")))

/**
 * \brief Text retained memory attribute
 */
#if ((dg_configCODE_LOCATION == NON_VOLATILE_IS_FLASH) && (dg_configEXEC_MODE == MODE_IS_CACHED))
#define __RETAINED_CODE         __attribute__((section("text_retained"))) __attribute__((noinline)) __attribute__((optimize ("no-tree-switch-conversion")))
#else
#define __RETAINED_CODE
#endif

/**
 * \brief Attribute to tell the compiler to consider a symbol as used
 */
#define __USED                  __attribute__((used))

/**
 * \brief Attribute to tell the compiler to consider a symbol as externally visible (for LTO)
 */
#define __LTO_EXT               __attribute__((externally_visible))

extern uint32_t black_orca_chip_version;

#define CHIP_IS_AE                      (black_orca_chip_version == BLACK_ORCA_IC_VERSION(A, E))
#define CHIP_IS_BB                      (black_orca_chip_version == BLACK_ORCA_IC_VERSION(B, B))

/**
 * \brief Get the chip version of the system, at runtime.
 */
__STATIC_INLINE uint32_t black_orca_get_chip_version(void)
{
        uint32_t rev = CHIP_VERSION->CHIP_REVISION_REG - 'A';
        uint32_t step = CHIP_VERSION->CHIP_TEST1_REG;

        return _BLACK_ORCA_IC_VERSION(rev, step);
}

