S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/sdk_defs.h
// Forward declaration
__RETAINED_CODE void hw_cpm_assert_trigger_gpio(void);

/**
 * \brief Assert as warning macro
 *
 * \note Active only while in development mode
 */
#define ASSERT_WARNING(a)                                                                       \
        {                                                                                       \
                if (!(a)) {                                                                     \
                        if (dg_configIMAGE_SETUP == DEVELOPMENT_MODE) {                         \
                                __asm volatile ( " cpsid i " );                                 \
                                GPREG->SET_FREEZE_REG = GPREG_SET_FREEZE_REG_FRZ_WDOG_Msk;      \
                                hw_cpm_assert_trigger_gpio();                                   \
                                do {} while(1);                                                 \
                        }                                                                       \
                }                                                                               \
        }

/**
 * \brief Assert as error macro
 *
 */
#define ASSERT_ERROR(a)                                                                         \
        {                                                                                       \
                if (dg_configIMAGE_SETUP == DEVELOPMENT_MODE) {                                 \
                        if (!(a)) {                                                             \
                                __asm volatile ( " cpsid i " );                                 \
                                GPREG->SET_FREEZE_REG = GPREG_SET_FREEZE_REG_FRZ_WDOG_Msk;      \
                                hw_cpm_assert_trigger_gpio();                                   \
                                do {} while(1);                                                 \
                        }                                                                       \
                }                                                                               \
                else {                                                                          \
                        if (!(a)) {                                                             \
                                __asm volatile ( " cpsid i " );                                 \
                                __asm volatile ( " bkpt 2 " );                                  \
                        }                                                                       \
                }                                                                               \
        }

/**
 * \brief Assert as warning macro when the system is still uninitialized
 *
 * \note Active only while in development mode. The SW cursor is not activated.
 */
#define ASSERT_WARNING_UNINIT(a)                                                                \
        {                                                                                       \
                if (!(a)) {                                                                     \
                        if (dg_configIMAGE_SETUP == DEVELOPMENT_MODE) {                         \
                                __asm volatile ( " cpsid i " );                                 \
                                GPREG->SET_FREEZE_REG = GPREG_SET_FREEZE_REG_FRZ_WDOG_Msk;      \
                                do {} while(1);                                                 \
                        }                                                                       \
                }                                                                               \
        }

/**
 * \brief Assert as error macro when the system is still uninitialized
 *
 * \note The SW cursor is not activated.
 */
#define ASSERT_ERROR_UNINIT(a)                                                                  \
        {                                                                                       \
                if (dg_configIMAGE_SETUP == DEVELOPMENT_MODE) {                                 \
                        if (!(a)) {                                                             \
                                __asm volatile ( " cpsid i " );                                 \
                                GPREG->SET_FREEZE_REG = GPREG_SET_FREEZE_REG_FRZ_WDOG_Msk;      \
                                do {} while(1);                                                 \
                        }                                                                       \
                }                                                                               \
                else {                                                                          \
                        if (!(a)) {                                                             \
                                __asm volatile ( " cpsid i " );                                 \
                                __asm volatile ( " bkpt 2 " );                                  \
                        }                                                                       \
                }                                                                               \
        }

/**
 * \brief Macro to disable all interrupts
 *
 * This macro must always be used with GLOBAL_INT_RESTORE(). E.g.
 *
 * \code{.c}
 * GLOBAL_INT_DISABLE();
 *  ... code to be executed with interrupts disabled ...
 * GLOBAL_INT_RESTORE();
 * \endcode
 *
 * \sa GLOBAL_INT_RESTORE
 */
#define GLOBAL_INT_DISABLE()                                                            \
        do {                                                                            \
                unsigned int __l_irq_rest;                                     \
                __asm volatile ("mrs   %0, primask  \n\t"                               \
                              "mov   r1, $1     \n\t"                                   \
                              "msr   primask, r1  \n\t"                                 \
                              : "=r" (__l_irq_rest)                                     \
                              :                                                         \
                              : "r1"                                                    \
                              );                                                        \
               DBG_CONFIGURE_HIGH(CMN_TIMING_DEBUG, CMNDBG_CRITICAL_SECTION);

/**
 * \brief Macro to restore all interrupts
 *
 * This macro must always be used after GLOBAL_INT_DISABLE(). E.g.
 *
 * \code{.c}
 * GLOBAL_INT_DISABLE();
 *  ... code to be executed with interrupts disabled ...
 * GLOBAL_INT_RESTORE();
 * \endcode
 *
 * \sa GLOBAL_INT_DISABLE
 */
#define GLOBAL_INT_RESTORE()                                                            \
                if (__l_irq_rest == 0) {                                                \
                        DBG_CONFIGURE_LOW(CMN_TIMING_DEBUG, CMNDBG_CRITICAL_SECTION);   \
                }                                                                       \
                __asm volatile ("msr   primask, %0  \n\t"                               \
                                                          :                             \
                                                          : "r" (__l_irq_rest)          \
                                                          :                             \
                                                          );                            \
        } while(0)

